{
    "vocab_size": 97280,
    "n_positions": 2048,
    "n_embd": 12288,
    "n_layer": 96,
    "n_head": 96,
    "n_inner": 49152,
    "activation_function": "gelu",
    "resid_pdrop": 0.1,
    "embd_pdrop": 0.1,
    "attn_pdrop": 0.1,
    "layer_norm_epsilon": 1e-05,
    "initializer_range": 0.02,
    "summary_type": "cls_index",
    "summary_use_proj": true,
    "summary_activation": null,
    "summary_first_dropout": 0.1,
    "summary_proj_to_labels": true,
    "scale_attn_weights": true,
    "use_cache": true,
    "scale_attn_by_inverse_layer_idx": false,
    "reorder_and_upcast_attn": false,
    "layer_norm_type": null,
    "rotary_ndims": 32,
    "no_bias": false,
    "bos_token_id": 7,
    "eos_token_id": 7,
    "return_dict": true,
    "output_hidden_states": false,
    "output_attentions": false,
    "torchscript": false,
    "torch_dtype": null,
    "use_bfloat16": false,
    "tf_legacy_loss": false,
    "pruned_heads": {},
    "tie_word_embeddings": true,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "chunk_size_feed_forward": 0,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "architectures": [
        "LlmJpGPTLMHeadModel"
    ],
    "finetuning_task": null,
    "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
    },
    "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
    },
    "tokenizer_class": null,
    "prefix": null,
    "pad_token_id": null,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "task_specific_params": null,
    "problem_type": null,
    "_name_or_path": "",
    "transformers_version": "4.35.2",
    "n_ctx": 1024,
    "gradient_checkpointing": false,
    "model_type": "llm_jp_gpt",
    "auto_map": {
        "AutoConfig": "configuration_llm_jp_gpt.LlmJpGPTConfig",
        "AutoModel": "modeling_llm_jp_gpt.LlmJpGPTModel",
        "AutoModelForSequenceClassification": "modeling_llm_jp_gpt.LlmJpGPTForSequenceClassification",
        "AutoModelForTokenClassification": "modeling_llm_jp_gpt.LlmJpGPTForTokenClassification",
        "AutoModelForQuestionAnswering": "modeling_llm_jp_gpt.LlmJpGPTForQuestionAnswering",
        "AutoModelForCausalLM": "modeling_llm_jp_gpt.LlmJpGPTLMHeadModel"
    }
}
